app/Controllers/Admin/Dashboard.php

SELECT *
FROM `profil`
WHERE `id_user` = '7'
 LIMIT 1
SELECT *
FROM `instansi`
WHERE `status_aktif` = 1
SELECT `id_instansi`
FROM `data_presensi`
WHERE `tanggal` = '2026-05-31'
AND `status` IN ('hadir','terlambat')
GROUP BY `id_instansi`
---
    public function index()
    {
        $presensiModel  = new PresensiModel();
        $instansiModel  = new InstansiModel();
        $pengajuanModel = new PengajuanModel();
        $profilModel    = new ProfilModel();

        $hariIni = date('Y-m-d');
        $idUser  = session()->get('id_user');

        $profil = $profilModel->where('id_user', $idUser)->first();
        if ($profil) {
            session()->set('foto_profil', $profil['foto']);
            session()->set('nama', $profil['nama']);
            session()->set('jabatan', $profil['jabatan']);
        }

        $semuaInstansi = $instansiModel->where('status_aktif', 1)->findAll();

        // HADIR = hanya instansi yang punya presensi status 'hadir' atau 'terlambat'
        // Izin/sakit/cuti TIDAK dihitung sebagai hadir
        $hadirResult = $presensiModel
            ->select('id_instansi')
            ->where('tanggal', $hariIni)
            ->whereIn('status', ['hadir', 'terlambat'])
            ->groupBy('id_instansi')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `data_presensi`
WHERE `tanggal` = '2026-05-31'
AND `status` = 'terlambat'
SELECT COUNT(*) AS `numrows`
FROM `data_presensi`
WHERE `tanggal` = '2026-05-31'
AND `status` = 'izin'
SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
WHERE `status_pengajuan` = 'menunggu'
---
        $jumlahHadir      = count($hadirIds);
        $jumlahTidakHadir = count($semuaInstansi) - $jumlahHadir;

        $jumlahTerlambat = $presensiModel->where('tanggal', $hariIni)->where('status', 'terlambat')->countAllResults();
        $jumlahIzin      = $presensiModel->where('tanggal', $hariIni)->where('status', 'izin')->countAllResults();
        $jumlahPending   = $pengajuanModel->where('status_pengajuan', 'menunggu')->countAllResults();
        $jumlahDisetujui = $pengajuanModel->where('status_pengajuan', 'disetujui')->countAllResults();
        $jumlahDitolak   = $pengajuanModel->where('status_pengajuan', 'ditolak')->countAllResults();