app/Controllers/Admin/Pegawai.php

SELECT `profil`.*, `user`.`email`, `user`.`is_active`, `user`.`device_token`, `instansi`.`nama_instansi`
FROM `profil`
LEFT JOIN `user` ON `user`.`id_user` = `profil`.`id_user`
LEFT JOIN `instansi` ON `instansi`.`id_instansi` = `profil`.`id_instansi`
WHERE `user`.`role` = 'pegawai'
AND `user`.`is_active` = 1
ORDER BY `profil`.`nama` ASC
SELECT `user`.`id_user`, `user`.`email`, `user`.`created_at`, `profil`.`nama`, `profil`.`no_id`, `profil`.`jabatan`, `instansi`.`nama_instansi`
FROM `user`
LEFT JOIN `profil` ON `profil`.`id_user` = `user`.`id_user`
LEFT JOIN `instansi` ON `instansi`.`id_instansi` = `profil`.`id_instansi`
WHERE `user`.`is_active` = 0
AND `user`.`role` = 'pegawai'
ORDER BY `user`.`created_at` DESC
SELECT *
FROM `instansi`
WHERE `status_aktif` = 1
---
    public function index()
    {
        // Semua pegawai aktif
        $pegawai = $this->profilModel
            ->select('profil.*, user.email, user.is_active, user.device_token, instansi.nama_instansi')
            ->join('user', 'user.id_user = profil.id_user', 'left')
            ->join('instansi', 'instansi.id_instansi = profil.id_instansi', 'left')
            ->where('user.role', 'pegawai')
            ->where('user.is_active', 1)
            ->orderBy('profil.nama', 'ASC')
            ->findAll();

        // Akun menunggu persetujuan
        $menunggu = $this->userModel
            ->select('user.id_user, user.email, user.created_at, profil.nama, profil.no_id, profil.jabatan, instansi.nama_instansi')
            ->join('profil', 'profil.id_user = user.id_user', 'left')
            ->join('instansi', 'instansi.id_instansi = profil.id_instansi', 'left')
            ->where('user.is_active', 0)
            ->where('user.role', 'pegawai')
            ->orderBy('user.created_at', 'DESC')
            ->findAll();

        return view('admin/pegawai/index', [
            'title'    => 'Kelola Pegawai',
            'pegawai'  => $pegawai,
            'menunggu' => $menunggu,
            'instansi' => $this->instansiModel->where('status_aktif', 1)->findAll(),