app/Controllers/Admin/Presensi.php

    public function index()
    {
        $filter  = $this->request->getGet('filter')  ?? 'harian';
        $tahun   = $this->request->getGet('tahun')   ?? date('Y');
        $bulan   = $this->request->getGet('bulan')   ?? date('m');
        $minggu  = $this->request->getGet('minggu')  ?? date('W');
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');

        $builder = $this->presensiModel
            ->select('data_presensi.*, profil.nama AS nama, profil.no_id AS no_id_pegawai, instansi.nama_instansi')
            ->join('profil', 'profil.id_user = data_presensi.id_user', 'left')
            ->join('instansi', 'instansi.id_instansi = data_presensi.id_instansi', 'left');

        if ($filter === 'harian') {
            $builder->where('data_presensi.tanggal', $tanggal);
        } elseif ($filter === 'mingguan') {
            $dto = new \DateTime();
            $dto->setISODate((int)$tahun, (int)$minggu);
            $senin       = $dto->format('Y-m-d');
            $dto->modify('+6 days');
            $mingguAkhir = $dto->format('Y-m-d');
            $builder->where('data_presensi.tanggal >=', $senin)
                    ->where('data_presensi.tanggal <=', $mingguAkhir);
        } elseif ($filter === 'bulanan') {
            $builder->where('YEAR(data_presensi.tanggal)', $tahun)
                    ->where('MONTH(data_presensi.tanggal)', $bulan);
        }

        $data = $builder->orderBy('data_presensi.tanggal', 'DESC')->findAll();
---
SELECT `data_presensi`.*, `profil`.`nama` AS `nama`, `profil`.`no_id` AS `no_id_pegawai`, `instansi`.`nama_instansi`
FROM `data_presensi`
LEFT JOIN `profil` ON `profil`.`id_user` = `data_presensi`.`id_user`
LEFT JOIN `instansi` ON `instansi`.`id_instansi` = `data_presensi`.`id_instansi`
WHERE `data_presensi`.`tanggal` = '2026-05-29'
ORDER BY `data_presensi`.`tanggal` DESC

    public function tambah()
    {
        $jenis = $this->request->getGet('jenis');

        // Ambil semua pegawai beserta no_id dan instansinya untuk dropdown
        $pegawai = $this->profilModel
            ->select('profil.id_user, profil.nama, profil.no_id, profil.id_instansi, instansi.nama_instansi')
            ->join('instansi', 'instansi.id_instansi = profil.id_instansi', 'left')
            ->join('user', 'user.id_user = profil.id_user', 'left')
            ->where('user.is_active', 1)
            ->where('user.role', 'pegawai')
            ->orderBy('profil.nama', 'ASC')
            ->findAll();

        return view('admin/presensi/tambah', [
            'instansi' => $this->instansiModel->where('status_aktif', 1)->findAll(),
            'pegawai'  => $pegawai,
            'jenis'    => $jenis,
        ]);
---
SELECT `profil`.`id_user`, `profil`.`nama`, `profil`.`no_id`, `profil`.`id_instansi`, `instansi`.`nama_instansi`
FROM `profil`
LEFT JOIN `instansi` ON `instansi`.`id_instansi` = `profil`.`id_instansi`
LEFT JOIN `user` ON `user`.`id_user` = `profil`.`id_user`
WHERE `user`.`is_active` = 1
AND `user`.`role` = 'pegawai'
ORDER BY `profil`.`nama` ASC
SELECT *
FROM `instansi`
WHERE `status_aktif` = 1