app/Views/layout/admin.php

        <a href="/admin/pegawai"   class="<?= ($seg2=='pegawai')  ?'active':'' ?>" style="position:relative;">
            <i class="bi bi-people-fill"></i> Kelola Pegawai
            <?php
            $pendingPegawai = (new \App\Models\UserModel())->where('is_active',0)->where('role','pegawai')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `is_active` = 0
AND `role` = 'pegawai'