app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'cicinanda335@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $userModel = new UserModel();

        $email       = $this->request->getPost('email');
        $password    = $this->request->getPost('password');
        $deviceToken = trim($this->request->getPost('device_token') ?? '');

        $user = $userModel->where('email', $email)->first();

SELECT *
FROM `instansi`
WHERE `status_aktif` = 1
---
    public function register()
    {
        $instansiModel = new \App\Models\InstansiModel();
        return view('auth/register', [
            'instansi' => $instansiModel->where('status_aktif', 1)->findAll(),
        ]);